Catalogs/RolesOfUsers.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>RolesOfUsers</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Role</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AccessRightsToSystemObjects</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SystemObject</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SystemObjects</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Read</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Edit</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MarkForDeletion</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAccessRights</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AccessRight</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AdditionalAccessRights</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>MobileAppAccessRights</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>AccessRight</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MobileAppAccessRights</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/RolesOfUsers/Ext/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	
	HasAccessToMobileApp = False;
	
	If Not MobileAppAccessRights.Find(Catalogs.MobileAppAccessRights.AccessToMobileApp) = Undefined Then 
		
		HasAccessToMobileApp = True;
		
	EndIf;
	
	HasAccessTo1C = False;
	
	If Not AccessRightsToSystemObjects.Find(True, "Read") = Undefined Then 
		
		HasAccessTo1C = True;
		
	EndIf;
	
	If HasAccessTo1C And HasAccessToMobileApp Then 
		
		Role = "SRM_SR";
		
	ElsIf HasAccessTo1C And Not HasAccessToMobileApp Then 
		
		Role = "SRM";
		
	ElsIf Not HasAccessTo1C And HasAccessToMobileApp Then 
		
		Role = "SR";
		
	Else 
		
		Role = "Unknown";
		
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	Users.SetRolesOfUsers(Ref);
	
EndProcedure
